app/controllers/articulos_controller.rb

SELECT "articulos".* FROM "articulos" WHERE "articulos"."user_id" = $1  ORDER BY descripcion ASC  [["user_id", 3]]
---
  def index
    if params[:search]
      @articulos = Articulo.where(user_id: current_user.id).search(params[:search]).paginate(page: params[:page], per_page: 50)