app/controllers/componentes_controller.rb

  def index
    @componentes = Componente.where(user_id: current_user.id).order("nombre ASC")
---
SELECT "componentes".* FROM "componentes" WHERE "componentes"."user_id" = $1  ORDER BY nombre ASC  [["user_id", 3]]