app/controllers/compras_controller.rb

SELECT COUNT(*) FROM "compras" WHERE "compras"."user_id" = $1  [["user_id", 3]]
SELECT  "compras".* FROM "compras" WHERE "compras"."user_id" = $1  ORDER BY created_at desc, fecha_ingreso desc, num_factura desc LIMIT 50 OFFSET 0  [["user_id", 3]]
---
   def index
     if params[:search] and params[:filter] and params[:datefilter]
       @compras = Compra.where(user_id: current_user.id).search(params[:search], params[:filter], params[:datefilter]).order("fecha_ingreso desc, num_factura desc").paginate(page: params[:page], per_page: 9999999)
       #@reportes = Compra.search(params[:search], params[:filter], params[:datefilter]).order("nombre ASC")
     else
       @compras = Compra.where(user_id: current_user.id).order("created_at desc, fecha_ingreso desc, num_factura desc").paginate(page: params[:page], per_page: 50)