app/controllers/einvoices_controller.rb

  def index
    @einvoices = Einvoice.all
---
SELECT "einvoices".* FROM "einvoices"