app/controllers/medidas_controller.rb

  def index
    @medidas = Medida.where(user_id: current_user.id).order("nombre ASC")
---
SELECT "medidas".* FROM "medidas" WHERE "medidas"."user_id" = $1  ORDER BY nombre ASC  [["user_id", 3]]