app/controllers/modelos_controller.rb

SELECT "modelos".* FROM "modelos" WHERE "modelos"."user_id" = $1  ORDER BY nombre ASC  [["user_id", 3]]
---
  def index
    @modelos = Modelo.where(user_id: current_user.id).order("nombre ASC")