app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles"
---
  def index
    @roles = Role.all