app/controllers/saleheaders_controller.rb

  def index
    @saleheaders = Saleheader.all
---
SELECT "saleheaders".* FROM "saleheaders"